swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c

/**************************************************************************//**
 * @file     rtl8195bhp_pwm.c
 * @brief    This file implements the PWM HAL functions.
 *
 * @version  V1.00
 * @date     2016-07-22
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_pwm.h"
#include "rtl8735b_pin_name.h"
//#include "rtl8735b_pwm_type.h"


#if CONFIG_PWM_EN && CONFIG_GTIMER_EN

#define SECTION_PWM_TEXT           SECTION(".rom.hal_pwm.text")
#define SECTION_PWM_DATA           SECTION(".rom.hal_pwm.data")
#define SECTION_PWM_RODATA         SECTION(".rom.hal_pwm.rodata")
#define SECTION_PWM_BSS            SECTION(".rom.hal_pwm.bss")
#define SECTION_PWM_STUBS          SECTION(".rom.hal_pwm.stubs")

extern void *_memset(void *dst0, int Val, SIZE_T length);
extern phal_timer_group_adapter_t ptimer_group2;
/**
 * @addtogroup hs_hal_pwm PWM
 * @{
 */
void PWM_IRQHandler(void);

#if !defined(CONFIG_BUILD_NONSECURE)
#undef PWM_COMM_REG_BASE
#define PWM_COMM_REG_BASE (PWM_COMM_S)

#else

#undef PWM_COMM_REG_BASE
#define PWM_COMM_REG_BASE (PWM_COMM)

#endif

#if !defined(CONFIG_BUILD_NONSECURE)
#undef PWM0_REG_BASE
#define PWM0_REG_BASE (PWM0_S)
#undef PWM1_REG_BASE
#define PWM1_REG_BASE (PWM1_S)
#undef PWM2_REG_BASE
#define PWM2_REG_BASE (PWM2_S)
#undef PWM3_REG_BASE
#define PWM3_REG_BASE (PWM3_S)
#undef PWM4_REG_BASE
#define PWM4_REG_BASE (PWM4_S)
#undef PWM5_REG_BASE
#define PWM5_REG_BASE (PWM5_S)
#undef PWM6_REG_BASE
#define PWM6_REG_BASE (PWM6_S)
#undef PWM7_REG_BASE
#define PWM7_REG_BASE (PWM7_S)
#undef PWM8_REG_BASE
#define PWM8_REG_BASE (PWM8_S)
#undef PWM9_REG_BASE
#define PWM9_REG_BASE (PWM9_S)
#undef PWM10_REG_BASE
#define PWM10_REG_BASE (PWM10_S)
#undef PWM11_REG_BASE
#define PWM11_REG_BASE (PWM11_S)

#else

#undef PWM0_REG_BASE
#define PWM0_REG_BASE (PWM0)
#undef PWM1_REG_BASE
#define PWM1_REG_BASE (PWM1)
#undef PWM2_REG_BASE
#define PWM2_REG_BASE (PWM2)
#undef PWM3_REG_BASE
#define PWM3_REG_BASE (PWM3)
#undef PWM4_REG_BASE
#define PWM4_REG_BASE (PWM4)
#undef PWM5_REG_BASE
#define PWM5_REG_BASE (PWM5)
#undef PWM6_REG_BASE
#define PWM6_REG_BASE (PWM6)
#undef PWM7_REG_BASE
#define PWM7_REG_BASE (PWM7)
#undef PWM8_REG_BASE
#define PWM8_REG_BASE (PWM8)
#undef PWM9_REG_BASE
#define PWM9_REG_BASE (PWM9)
#undef PWM10_REG_BASE
#define PWM10_REG_BASE (PWM10)
#undef PWM11_REG_BASE
#define PWM11_REG_BASE (PWM11)


#endif


/**
  * @brief The table of all PWM registers base address.
  */

SECTION_PWM_RODATA
const PWM_TypeDef *pwm_base_address[MaxPwmNum] = {
	PWM0_REG_BASE, PWM1_REG_BASE, PWM2_REG_BASE, PWM3_REG_BASE,
	PWM4_REG_BASE, PWM5_REG_BASE, PWM6_REG_BASE, PWM7_REG_BASE,
	PWM8_REG_BASE, PWM9_REG_BASE, PWM10_REG_BASE, PWM11_REG_BASE
};

//SECTION_PWM_RODATA
//const PWM_Type *pwm_base_address[MaxPwmNum] = {
//    PWM0, PWM1, PWM2, PWM3,
//    PWM4, PWM5, PWM6, PWM7,
//    PWM8, PWM9, PWM10, PWM11
//};





/**
  * @brief The table of all PWM pin selection registers address.
  */
SECTION_PWM_RODATA
u32 pwm_pin_table[2 * MaxPwmNum] = {
	PIN_F6, PIN_F7, PIN_F8, PIN_F9, PIN_F10, PIN_F11, PIN_F12, PIN_F13, PIN_F14, PIN_F15, PIN_F16, PIN_F17,  // S0
	PIN_NC, PIN_NC, PIN_NC, PIN_NC, PIN_NC,  PIN_NC,  PIN_NC,  PIN_NC,  PIN_S1,  PIN_S4,  PIN_S5,  PIN_S6   // S1

};


/**
  * @brief The global data structure to handle common resource
  *        for all PWM adapters.
  */
SECTION_PWM_BSS hal_pwm_comm_adapter_t *ppwm_comm_adapter;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_pwm_rom_func PWM HAL ROM APIs.
 * @ingroup hs_hal_pwm
 * @{
 * @brief The PWM HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of PWM HAL APIs in the RAM space is provided for the user application.
 */

/**
  \brief  The stubs functions table of the PWM HAL functions in ROM.
*/
SECTION_PWM_STUBS const hal_pwm_func_stubs_t hal_pwm_stubs = {
	.pppwm_comm_adp = &ppwm_comm_adapter,
	.pwm_pin_table = &pwm_pin_table[0],
	.hal_pwm_irq_handler = PWM_IRQHandler,
	.hal_pwm_comm_irq_reg = hal_rtl_pwm_comm_irq_reg,
	.hal_pwm_comm_irq_unreg = hal_rtl_pwm_comm_irq_unreg,
	.hal_pwm_comm_init = hal_rtl_pwm_comm_init,
	.hal_pwm_comm_tick_source_list = hal_rtl_pwm_comm_tick_source_list,
	.hal_pwm_init = hal_rtl_pwm_init,
	.hal_pwm_comm_deinit = hal_rtl_pwm_comm_deinit,
	.hal_pwm_enable_sts = hal_rtl_pwm_enable_sts,
	.hal_pwm_comm_enable = hal_rtl_pwm_comm_enable,
	.hal_pwm_comm_disable = hal_rtl_pwm_comm_disable,
	.hal_pwm_enable = hal_rtl_pwm_enable,
	.hal_pwm_disable = hal_rtl_pwm_disable,
	.hal_pwm_deinit = hal_rtl_pwm_deinit,
	.hal_pwm_set_clk_sel = hal_rtl_pwm_set_clk_sel,
	.hal_pwm_wait_ctrl_ready = hal_rtl_pwm_wait_ctrl_ready,
	.hal_pwm_set_tick_time = hal_rtl_pwm_set_tick_time,
	.hal_pwm_set_duty = hal_rtl_pwm_set_duty,
	.hal_pwm_read_duty = hal_rtl_pwm_read_duty,
	.hal_pwm_change_duty = hal_rtl_pwm_change_duty,
	.hal_pwm_set_duty_limit = hal_rtl_pwm_set_duty_limit,
	.hal_pwm_set_auto_duty_adj = hal_rtl_pwm_set_auto_duty_adj,
	.hal_pwm_auto_duty_en = hal_rtl_pwm_auto_duty_en,
	.hal_pwm_set_auto_duty_inc = hal_rtl_pwm_set_auto_duty_inc,
	.hal_pwm_set_auto_duty_dec = hal_rtl_pwm_set_auto_duty_dec,
	.hal_pwm_set_auto_duty_loop = hal_rtl_pwm_set_auto_duty_loop,
	.hal_pwm_set_period_int = hal_rtl_pwm_set_period_int,
	.hal_pwm_set_autoadj_int = hal_rtl_pwm_set_autoadj_int,
	.hal_pwm_set_autoadj_loop_int = hal_rtl_pwm_set_autoadj_loop_int,
	.hal_pwm_auto_duty_inc = hal_rtl_pwm_auto_duty_inc,
	.hal_pwm_auto_duty_dec = hal_rtl_pwm_auto_duty_dec,
	.hal_pwm_auto_duty_loop = hal_rtl_pwm_auto_duty_loop,
	.hal_pwm_stop_duty_loop = hal_rtl_pwm_stop_duty_loop,
	.hal_pwm_set_duty_ns = hal_rtl_pwm_set_duty_ns,
	.hal_pwm_auto_duty_ns_inc = hal_rtl_pwm_auto_duty_ns_inc,
	.hal_pwm_auto_duty_ns_dec = hal_rtl_pwm_auto_duty_ns_dec,
	.hal_pwm_read_duty_ns = hal_rtl_pwm_read_duty_ns,
	.hal_pwm_dma_init     = hal_rtl_pwm_dma_init,
	.hal_pwm_dma_send     = hal_rtl_pwm_dma_send,
	.hal_pwm_cache        = hal_rtl_pwm_cache,
	.hal_pwm_complementary = hal_rtl_pwm_complementary,
#if !defined(CONFIG_BUILD_NONSECURE)
	.hal_pwm_clk_sel = hal_rtl_pwm_clk_sel,
	.hal_pwm_clock_init = hal_rtl_pwm_clock_init
#endif
};

/**
 *  \brief To enable or disable a PWM function block.
 *
 *  \param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_en_ctrl(BOOL en)
{
	//SYSON->hs_tef_ctrl_b.tef_en = en;
}

/**
 *  \brief To enable/disable the APB clock for PWM.
 *
 *  \param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_pclk_ctrl(BOOL en)
{
	//SYSON->hs_tef_ctrl_b.tef_pclk_en = en;
}

/**
 *  \brief To enable/disable the system clock for PWM.
 *
 *  \param[in] en  Enable control: 0: disable, 1: enable.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_sclk_ctrl(BOOL en)
{
	//SYSON->hs_tef_ctrl_b.tef_sclk_en = en;
}

/**
 *  \brief To select the clock source for PWM interrupt detection.
 *
 *  \param[in] int_clk  The clock source selection: 0: APB clock, 1: S-CLK.
 *                  When entering sleep mode, the interrupt clock source
 *                  should be switched to 32K for wake-up by GPIO interrupt.
 *
 *  \returns void
 */
#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_PWM_TEXT
void hal_rtl_pwm_int_clk_sel(pwm_int_clk_t int_clk)
{
	u32 val;
	val = HAL_READ32(0x40009800, 0x2C);
	if (int_clk == PWM_IntClk_APB) {
		val = val & ~(PON_BIT_INTR_CLK_PWM_SEL);
	} else if (int_clk == PWM_IntClk_32K) {
		val = val & ~(PON_BIT_INTR_CLK_PWM_SEL);
		val = val | PON_BIT_INTR_CLK_PWM_SEL;
	}
	HAL_WRITE32(0x40009800, 0x2C, val);

