swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
}
#endif


#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_PWM_TEXT
void hal_rtl_pwm_sclk_sel(int sclk_sel)
{

	hal_rtl_sys_set_clk(PWM_SYS, sclk_sel);

//    u32 val;
//
//    val = HAL_READ32(0x40009800, 0x2C);
//    if(sclk_sel == PWM_Sclk_32k){
//        val = val & ~(PON_MASK_SCLK_PWM_SEL);
//    }
//    else if(sclk_sel == PWM_Sclk_4M){
//        val = val & ~(PON_MASK_SCLK_PWM_SEL);
//        val = val | ( (sclk_sel) << PON_SHIFT_SCLK_PWM_SEL);
//    }
//    else if(sclk_sel == PWM_Sclk_40M){
//        val = val & ~(PON_MASK_SCLK_PWM_SEL);
//        val = val | ( (sclk_sel) << PON_SHIFT_SCLK_PWM_SEL);
//    }
//
//    HAL_WRITE32(0x40009800, 0x2C, val);

}
#endif


/**
 *  \brief To handle the PWM interrupt.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void PWM_IRQHandler(void)
{
	hal_pwm_comm_adapter_t *ppwm_com_adp = ppwm_comm_adapter;
	hal_pwm_adapter_t *ppwm_adp;
	//pwm_comm_int_status_t int_sts;
	//pwm_comm_int_status_t int_sts1;
	//pwm_auto_adj_ctrl_t pwm_adj_ctrl;
	u32 i;
	u32 j;
	u32 duty;
	u8 dn_lim_int;
	u8 up_lim_int;
	u8 period_int;

	hal_rtl_irq_clear_pending(PWM_IRQn);

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_com_adp->base_addr);
	//PWM_TypeDef* PWM_OBJ = (PWM_TypeDef*)(ppwm_adp->base_addr);

	u32 int_sts_u, int_sts1_u;
	int_sts_u = PWM_COMM_OBJ->PWM_COMM_INT_STATUS;
	int_sts1_u = PWM_COMM_OBJ->PWM_COMM_INT_STATUS1;

	PWM_COMM_OBJ->PWM_COMM_INT_STATUS |= int_sts_u;
	PWM_COMM_OBJ->PWM_COMM_INT_STATUS1 |= int_sts1_u;


	for (i = 0; i < 12; i++) { // MaxPwmNum
		//dbg_printf("i %x\r\n", i);
		if (ppwm_com_adp->pwm_adapter[i] != NULL) {
			ppwm_adp = ppwm_com_adp->pwm_adapter[i];
			PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

			dn_lim_int = (((int_sts_u & PWM_COMM_MASK_DUTY_ADJ_DN_LIM) >> PWM_COMM_SHIFT_DUTY_ADJ_DN_LIM)  >> i) &  0x01;
			up_lim_int = (((int_sts_u & PWM_COMM_MASK_DUTY_ADJ_UP_LIM) >> PWM_COMM_SHIFT_DUTY_ADJ_UP_LIM)   >> i) &  0x01;
			period_int = (((int_sts_u & PWM_COMM_MASK_PERIOD_END)       >> PWM_COMM_SHIFT_PERIOD_END)       >> i) &  0x01;


#if 1
			if (i > 7) {
				//dbg_printf("index %x %x\r\n", i, int_sts1.b.period_end);
//                j = i - 8;
//                dn_lim_int = (int_sts1.b.duty_adj_dn_lim >> j) & 0x01;
//                up_lim_int = (int_sts1.b.duty_adj_up_lim >> j) & 0x01;
//                period_int = (int_sts1.b.period_end >> j) & 0x01;

				j = i - 8;
				dn_lim_int = (((int_sts1_u & PWM_COMM_MASK_DUTY_ADJ_DN_LIM) >> PWM_COMM_SHIFT_DUTY_ADJ_DN_LIM)  >> j) &  0x01;
				up_lim_int = (((int_sts1_u & PWM_COMM_MASK_DUTY_ADJ_UP_LIM) >> PWM_COMM_SHIFT_DUTY_ADJ_UP_LIM)   >> j) &  0x01;
				period_int = (((int_sts1_u & PWM_COMM_MASK_PERIOD_END)       >> PWM_COMM_SHIFT_PERIOD_END)       >> j) &  0x01;

			}
#endif


			//pwm_adj_ctrl.w = ppwm_adp->base_addr->auto_adj_ctrl;
			u32 ADJ_CTRL;
			ADJ_CTRL = PWM_OBJ->PWM_AUTO_ADJ_CTRL;


			if (dn_lim_int || up_lim_int) {
				// if not in auto adjustment loop mode, disable the interrupt
				if (ppwm_adp->duty_adj.loop_mode == PwmDutyLoopCnt) {
					if (ppwm_adp->adj_loop_count == 0) {
						ppwm_adp->duty_adj.loop_mode = 0;
						// Disable loop mode
//                            pwm_adj_ctrl.b.adj_dir = dn_lim_int; // ovride HW setting for next loop
//                            pwm_adj_ctrl.b.adj_loop_en = 0;
//                            pwm_adj_ctrl.b.adj_en = 0;

						if (dn_lim_int == 1) {
							ADJ_CTRL |= PWM_BIT_ADJ_DIR;
						} else {
							ADJ_CTRL &= (~PWM_BIT_ADJ_DIR);
						}
						ADJ_CTRL &= (~PWM_BIT_ADJ_LOOP_EN);
						ADJ_CTRL &= (~PWM_BIT_ADJ_EN);

						// Disable Interrupt
//                            pwm_adj_ctrl.b.duty_dn_lim_ie = 0;
//                            pwm_adj_ctrl.b.duty_up_lim_ie = 0;
//                            ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;

						ADJ_CTRL &= (~PWM_BIT_DUTY_DN_LIM_IE);
						ADJ_CTRL &= (~PWM_BIT_DUTY_UP_LIM_IE);
						PWM_OBJ->PWM_AUTO_ADJ_CTRL = ADJ_CTRL;

						// woraround for loop mode switch to non-loopmoce
						// write the duty limit to the duty size control
						if (up_lim_int) {
							//duty = ppwm_adp->base_addr->auto_adj_limit_b.duty_adj_up_lim;
							duty = (PWM_OBJ->PWM_AUTO_ADJ_LIMIT & PWM_MASK_DUTY_ADJ_UP_LIM) >> PWM_SHIFT_DUTY_ADJ_UP_LIM;
						} else {
							//duty = ppwm_adp->base_addr->auto_adj_limit_b.duty_adj_dn_lim;
							duty = (PWM_OBJ->PWM_AUTO_ADJ_LIMIT & PWM_MASK_DUTY_ADJ_DN_LIM) >> PWM_SHIFT_DUTY_ADJ_DN_LIM;
						}
						//ppwm_adp->base_addr->ctrl_b.duty = duty;
						PWM_OBJ->PWM_CTRL &= (~PWM_MASK_DUTY);
						PWM_OBJ->PWM_CTRL |= (duty & PWM_MASK_DUTY);
						//ppwm_adp->base_addr->ctrl_b.ctrl_set = 1;
						PWM_OBJ->PWM_CTRL |= PWM_BIT_CTRL_SET;

						if (ppwm_adp->loopout_callback != NULL) {
							ppwm_adp->loopout_callback(ppwm_adp->lo_cb_para);
						}
					} else {
						ppwm_adp->adj_loop_count--;
						if (ppwm_adp->adj_loop_count == 0) {
							//pwm_adj_ctrl.b.adj_loop_en = 0;
							ADJ_CTRL &= (~PWM_BIT_ADJ_LOOP_EN);
						}

						if (up_lim_int) {
//                            pwm_adj_ctrl.b.duty_up_lim_ie = 0;
//                            pwm_adj_ctrl.b.duty_dn_lim_ie = 1;

							ADJ_CTRL &= (~PWM_BIT_DUTY_UP_LIM_IE);
							ADJ_CTRL |= (PWM_BIT_DUTY_DN_LIM_IE);

						} else {
//                            pwm_adj_ctrl.b.duty_up_lim_ie = 1;
//                            pwm_adj_ctrl.b.duty_dn_lim_ie = 0;

							ADJ_CTRL |= (PWM_BIT_DUTY_UP_LIM_IE);
							ADJ_CTRL &= (~PWM_BIT_DUTY_DN_LIM_IE);
						}
						//ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;
						PWM_OBJ->PWM_AUTO_ADJ_CTRL = ADJ_CTRL;
					}
				} else if (ppwm_adp->duty_adj.loop_mode == PwmDutyLoopOff) {
//                        pwm_adj_ctrl.b.duty_dn_lim_ie = 0;
//                        pwm_adj_ctrl.b.duty_up_lim_ie = 0;
//                        pwm_adj_ctrl.b.adj_en = 0;
//                        ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;

					ADJ_CTRL &= (~PWM_BIT_DUTY_DN_LIM_IE);
					ADJ_CTRL &= (~PWM_BIT_DUTY_UP_LIM_IE);
					ADJ_CTRL &= (~PWM_BIT_ADJ_EN);
					PWM_OBJ->PWM_AUTO_ADJ_CTRL = ADJ_CTRL;
				}

				if (ppwm_adp->adj_int_en & PwmAdjIntUpLim) {
					//pwm_adj_ctrl.b.duty_up_lim_ie = 1;
					ADJ_CTRL |= PWM_BIT_DUTY_UP_LIM_IE;
				}

				if (ppwm_adp->bound_callback != NULL) {
					// Use the Up limit interrupt status as the direction indication
					if ((up_lim_int && (ppwm_adp->adj_int_en & PwmAdjIntUpLim)) ||
						(dn_lim_int && (ppwm_adp->adj_int_en & PwmAdjIntDnLim))) {
						ppwm_adp->bound_callback(ppwm_adp->bound_cb_para, up_lim_int);
					}
				}
			}

			if (period_int) {
				// interrupt on period time end, this is a proper time to modify the duty ratio or duty auto-adjustment
				//dbg_printf("period_int\r\n");
				if (ppwm_adp->period_callback != NULL) {
					// call the user PWM period end callback function
					// User may need to disable the period end interrupt in the calback function
					//dbg_printf("period_callback\r\n");
					ppwm_adp->period_callback(ppwm_adp->pe_cb_para);
				}
			}
		}
	}

	__DSB();
}

/**
 *  \brief To register a IRQ handler for the PWM common interrupt.
 *
 *  \param[in] irq_handler The IRQ handler.
 *  \param[in] arg The argument of the IRQ handler.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_comm_irq_reg(irq_handler_t irq_handler)
{
	// IRQ vector may has been registered, disable and re-register it
	hal_rtl_irq_disable(PWM_IRQn);
	__ISB();
	hal_rtl_irq_set_vector(PWM_IRQn, (uint32_t)irq_handler);
	hal_rtl_irq_set_priority(PWM_IRQn, PWM_IRQPri);
	hal_rtl_irq_enable(PWM_IRQn);
	//dbg_printf("pwm irq\r\n");
}

/**
 *  \brief To un-register the PWM common IRQ handler.
 *
 *  \param void.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_comm_irq_unreg(void)
{
	hal_rtl_irq_disable(PWM_IRQn);
	__ISB();
	hal_rtl_irq_set_vector(PWM_IRQn, (uint32_t)_default_handler);
}

