swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
#if 0
/**
 *  @brief To register a PWM duty ratio reachs the limit IRQ call back function
 *
 *  @param ppwm_adp The PWM device adapter.
 *  @param callback The call back function.
 *  @param phid The argument for call back function calling.
 *
 *  @returns void
 */
SECTION_PWM_TEXT
void hal_pwm_limirq_reg_rtl8195bhp(hal_pwm_adapter_t *ppwm_adp, pwm_lim_callback_t callback, void *phid)
{
	ppwm_adp->bound_callback = callback;
	ppwm_adp->bound_cb_para = phid;
}

/**
 *  @brief To un-register a PWM duty ratio reachs the limit IRQ.
 *
 *  @param ppwm_adp The PWM device adapter.
 *
 *  @returns void
 */
SECTION_PWM_TEXT
void hal_pwm_limirq_unreg_rtl8195bhp(hal_pwm_adapter_t *ppwm_adp)
{
	ppwm_adp->bound_callback = NULL;
	ppwm_adp->bound_cb_para = NULL;
}
#endif


#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_PWM_TEXT
void hal_rtl_pwm_clock_init(int en)
{
	hal_rtl_sys_peripheral_en(PWM_SYS, en);

}
#endif

#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_PWM_TEXT
void hal_rtl_pwm_clk_sel(int Sclk)
{
	hal_rtl_pwm_sclk_sel(Sclk);
}
#endif

/**
 *  \brief To initial the PWM devices common adapter. This function must be called first, before call
 *         any other PWM functions.
 *
 *  \param[in] ppwm_com_adp The PWM devices common adapter.
 *
 *  \returns void
 */
#define syson_ready 0

SECTION_PWM_TEXT
void hal_rtl_pwm_comm_init(hal_pwm_comm_adapter_t *ppwm_com_adp)
{
	u32 i;
	//u32 val;
	//int sclk_sel;

	ppwm_comm_adapter = ppwm_com_adp;
	ppwm_comm_adapter->base_addr = PWM_COMM; // PWM_COMM_REG_BASE
	for (i = 0; i < MaxPwmNum; i++) {
		ppwm_comm_adapter->pwm_adapter[i] = NULL;
	}
	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	// Clear all interrupt status: write clear
	PWM_COMM_OBJ->PWM_COMM_INT_STATUS = 0xFFFFFFFF;
	PWM_COMM_OBJ->PWM_COMM_INT_STATUS1 = 0xFFFFFFFF;

	// Register IRQ
	hal_rtl_pwm_comm_irq_reg((irq_handler_t)PWM_IRQHandler);


}

/**
 *  \brief To de-initial the PWM devices common adapter.
 *         The whole will be disabled and the clock will be gated.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_comm_deinit(void)
{
	if (ppwm_comm_adapter == NULL) {
		return;
	}

	hal_rtl_pwm_comm_disable(0xFF);      // disable all PWM
	// Clear all interrupt status: write clear
	//ppwm_comm_adapter->base_addr->int_status= 0xFFFFFFFF;
	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);
	PWM_COMM_OBJ->PWM_COMM_INT_STATUS = 0xFFFFFFFF;

	// PWM function and clock disable
	hal_rtl_pwm_pclk_ctrl(OFF);
	hal_rtl_pwm_sclk_ctrl(OFF);
	hal_rtl_pwm_en_ctrl(OFF);

	ppwm_comm_adapter = NULL;
}

/**
 *  \brief To give a list of g-timer ID as the tick source of PWM devices.
 *         The list should end with 0xFF
 *
 *  \param[in] timer_list The timer ID list those can be used as the PWM tick source.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_comm_tick_source_list(uint8_t *timer_list)
{
	ppwm_comm_adapter->timer_list = timer_list;
}

/**
 *  \brief To initial a PWM devices adapter. This is the first function must be called
 *         before to do any operation to the PWM devices.
 *
 *  \param[in] ppwm_adp The PWM devices adapter.
 *  \param[in] pwm_id The PWM devices index, valid value is 0 ~ (MaxPwmNum - 1).
 *  \param[in] duty_res_us The resolution for the duty duration setting, in us.
 *                     The value 0 means the duty resolution will be 1/4000 of PWM period.
 *
 *  \return     HAL_OK:  Setting succeed.
 *  \return     HAL_ERR_PARA:  Input arguments are invalid.
 *  \return     HAL_NOT_READY: Error with data not ready.
 */

#define pinmux_ready 0

SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_init(hal_pwm_adapter_t *ppwm_adp, u8 pwm_id, u8 pin_sel, u16 duty_res_us)
{
#if 0
	SYSON_Type *syson = SYSON;
#endif

	//dbg_printf("hal_pwm_init\r\n");

	if (ppwm_comm_adapter == NULL) {
		DBG_PWM_ERR("hal_pwm_init: PWM Com Struct No Initial!!\r\n");
		return HAL_NOT_READY;
	}

	if (pwm_id >= MaxPwmNum) {
		DBG_PWM_ERR("hal_pwm_init: Invalid PWM index\r\n");
		return HAL_ERR_PARA;
	}

	_memset((void *)ppwm_adp, 0, sizeof(hal_pwm_adapter_t));
	ppwm_adp->pwm_id = pwm_id;
	ppwm_adp->pin_sel = pin_sel;
	ppwm_adp->base_addr = (PWM_TypeDef *)pwm_base_address[pwm_id];
	ppwm_adp->pwm_clk_sel = PwmClkSrc_None;
	ppwm_adp->duty_res_us = duty_res_us;
	ppwm_comm_adapter->pwm_adapter[pwm_id] = ppwm_adp;

	//dbg_printf("pwm_id %x\r\n", pwm_id);

#if 0

	/* PWM function on and pin selection */
	switch (pwm_id) {
	case 0:
		syson->hs_tef_ctrl_b.pwm0_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm0_pin_en = 1;
		break;

	case 1:
		syson->hs_tef_ctrl_b.pwm1_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm1_pin_en = 1;
		break;

	case 2:
		syson->hs_tef_ctrl_b.pwm2_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm2_pin_en = 1;
		break;

	case 3:
		syson->hs_tef_ctrl_b.pwm3_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm3_pin_en = 1;
		break;

	case 4:
		syson->hs_tef_ctrl_b.pwm4_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm4_pin_en = 1;
		break;

	case 5:
		syson->hs_tef_ctrl_b.pwm5_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm5_pin_en = 1;
		break;

	case 6:
		syson->hs_tef_ctrl_b.pwm6_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm6_pin_en = 1;
		break;

	case 7:
		syson->hs_tef_ctrl_b.pwm7_pin_sel = pin_sel;
		syson->hs_tef_ctrl_b.pwm7_pin_en = 1;
		break;

	default:
		break;
	}

#endif

	return HAL_OK;
}

/**
 *  \brief To read a PWM devive enable status
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns 1: Enable.
 *  \returns 0: Disable.
 */
SECTION_PWM_TEXT
BOOLEAN hal_rtl_pwm_enable_sts(hal_pwm_adapter_t *ppwm_adp)
{
	if (ppwm_comm_adapter == NULL) {
		//dbg_printf("e1\r\n");
		return 0;
	}

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	//PWM_COMM_OBJ->PWM_COMM_ENABLE_STATUS & (1 << ppwm_adp->pwm_id);

	if (PWM_COMM_OBJ->PWM_COMM_ENABLE_STATUS & (1 << ppwm_adp->pwm_id)) {
		return 1;
	} else {
		return 0;
	}

}

/**
 *  \brief To enable multiple PWM devive simultaneously. If multiple PWM need to
 *         keep the phase offset, then they should be enabled simultaneously.
 *
 *  \param[in] en_ctrl The bit map for the PWM enable control. Bit [0 .. 7] map to PWM 0 .. 7.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_comm_enable(u32 en_ctrl)
{
	hal_pwm_adapter_t *ppwm_adp;
	u32 i;
	u32 j = 0;

