swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
	if (ppwm_comm_adapter == NULL) {
		return;
	}

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	PWM_COMM_OBJ->PWM_COMM_ENABLE_CTRL &= (~PWM_COMM_MASK_PWM_EN);
	PWM_COMM_OBJ->PWM_COMM_ENABLE_CTRL |= (en_ctrl & 0xfff);

	for (i = 0; i < MaxPwmNum; i++) {
		if ((en_ctrl & (1 << i)) && (ppwm_comm_adapter->pwm_adapter[i] != NULL)) {
			ppwm_adp = ppwm_comm_adapter->pwm_adapter[i];

			PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

			if ((((PWM_OBJ->PWM_CTRL) & PWM_BIT_PAUSE)) == 0) {
				while ((((PWM_OBJ->PWM_CTRL) & PWM_BIT_RUN_STS)) == 0) {
					hal_rtl_misc_delay_us(1);
					j++;
					if (j > 1000000) {
						DBG_PWM_ERR("hal_pwm_comm_enable: Wait PWM%u run timeout\r\n", i);
						break;
					}
				}
			}
		}
	}


}

/**
 *  \brief To disable multiple PWM devive simultaneously.
 *
 *  \param[in] dis_ctrl The bit map for the PWM disable control. Bit [0 .. 7] map to PWM 0 .. 7.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_comm_disable(u32 dis_ctrl)
{
	u32 i = 0;

	if (ppwm_comm_adapter == NULL) {
		return;
	}

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);
	PWM_COMM_OBJ->PWM_COMM_DISABLE_CTRL &= (~PWM_COMM_MASK_PWM_DIS);
	PWM_COMM_OBJ->PWM_COMM_DISABLE_CTRL |= (dis_ctrl & 0xff);

	// wait PWM stopped
	while ((PWM_COMM_OBJ->PWM_COMM_ENABLE_STATUS & dis_ctrl) != 0) {
		hal_rtl_misc_delay_us(1);
		i++;
		if (i > 1000000) {
			DBG_PWM_ERR("hal_pwm_comm_disable: Wait PWM stop timeout, en_status=0x%x\r\n",
						PWM_COMM_OBJ->PWM_COMM_ENABLE_STATUS);
			break;
		}
	}
}


/**
 *  \brief To enable a PWM devive.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_enable(hal_pwm_adapter_t *ppwm_adp)
{
	u32 i = 0;

	if (ppwm_comm_adapter == NULL) {
		return;
	}

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

	PWM_OBJ->PWM_CTRL |= PWM_BIT_CTRL_SET;


	PWM_COMM_OBJ->PWM_COMM_ENABLE_CTRL |= (1 << ppwm_adp->pwm_id);

	// wait PWM start
	if (((PWM_OBJ->PWM_CTRL & PWM_BIT_PAUSE)) == 0) {
		while (((PWM_OBJ->PWM_CTRL & PWM_BIT_RUN_STS)) == 0) {

			hal_rtl_misc_delay_us(1);
			i++;
			if (i > 1000000) {
				DBG_PWM_ERR("hal_pwm_enable: Wait PWM%u start timeout\r\n",
							ppwm_adp->pwm_id);
				break;
			}
		}
	}

}

/**
 *  \brief To disable a PWM devive.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_disable(hal_pwm_adapter_t *ppwm_adp)
{
	u32 i = 0;

	if (ppwm_comm_adapter == NULL) {
		return;
	}

	// pause the PWM first
	hal_rtl_pwm_pause(ppwm_adp, 1);
	// wait the PWM is paused
	while (hal_rtl_pwm_get_run_sts(ppwm_adp) == 1) {
		hal_rtl_misc_delay_us(1);
		i++;
		if (i > ppwm_adp->period_us) {
			break;
		}
	}

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	PWM_COMM_OBJ->PWM_COMM_DISABLE_CTRL |= 1 << ppwm_adp->pwm_id;


	// un-pause the PWM first
	hal_rtl_pwm_pause(ppwm_adp, 0);

}

/**
 *  @brief To disable and de-initial a PWM devices adapter.
 *
 *  @param[in] ppwm_adp The PWM devices adapter.
 *
 *  @returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_deinit(hal_pwm_adapter_t *ppwm_adp)
{
	u8 pwm_id;
	hal_pwm_adapter_t *ptmp_pwm_adp;
#if 0
	SYSON_Type *syson = SYSON;
#endif

	hal_rtl_pwm_disable(ppwm_adp);
	if ((ppwm_adp->pwm_clk_sel != PwmClkSrc_None) && (ppwm_adp->pwm_clk_sel != PwmClkSrc_SClk)) {
		// a G-timer has been assign to this PWM already, we should free this timer and reallocate a new timer
		for (pwm_id = 0; pwm_id < MaxPwmNum; pwm_id++) {
			ptmp_pwm_adp = ppwm_comm_adapter->pwm_adapter[pwm_id];
			if ((ptmp_pwm_adp != NULL) &&
				(ptmp_pwm_adp != ppwm_adp)) {
				if (ptmp_pwm_adp->pwm_clk_sel == ppwm_adp->pwm_clk_sel) {
					// other PWM still using the same G-Timer, cannot disable this timer
					break;  // break for loop
				}
			}
		}

		if (pwm_id == MaxPwmNum) {
			// no other PWM use the same G-timer, so we can disable it
			if ((ppwm_adp->pwm_clk_sel) < PwmClkSrc_SClk) {
				hal_rtl_timer_event_deinit((ppwm_adp->pwm_clk_sel));
			}
			//DBG_PWM_ERR ("gtimer_to_disable = (%d)\r\n", ppwm_adp->pwm_clk_sel);
			ppwm_adp->pwm_clk_sel = PwmClkSrc_None;
		}
	}

	//hal_pwm_disable_rtl8195bhp(ppwm_adp);

	pwm_id = ppwm_adp->pwm_id;
	ppwm_comm_adapter->pwm_adapter[pwm_id] = NULL;


#if 0
	/* PWM disable pin mux */
	syson->hs_tef_ctrl &= ~(1 << (8 + pwm_id));
#endif
}


/**
 *  \brief To set the PWM tick source selection.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] clk_sel The PWM tick source selection
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_set_clk_sel(hal_pwm_adapter_t *ppwm_adp, pwm_clk_sel_t clk_sel)
{
	BOOLEAN enabled;

	enabled = hal_rtl_pwm_enable_sts(ppwm_adp);

	// The PWM should be disabled before change the Clk source selection
	if (enabled) {
		hal_rtl_pwm_disable(ppwm_adp);
	}

	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 CLK_SEL;
	CLK_SEL = 0;
	CLK_SEL = (clk_sel << PWM_SHIFT_CLK_SEL);
	PWM_OBJ->PWM_CTRL &= (~PWM_MASK_CLK_SEL);
	PWM_OBJ->PWM_CTRL |= CLK_SEL;
	ppwm_adp->pwm_clk_sel = clk_sel;

	if (enabled) {
		hal_rtl_pwm_enable(ppwm_adp);
	}

}

/**
 *  \brief To wait the PWM HW ready to set new PWM period/duty/offset.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_wait_ctrl_ready(hal_pwm_adapter_t *ppwm_adp)
{
	u32 i;

	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

	for (i = 0; i < 1000000; i++) {
		if ((PWM_OBJ->PWM_CTRL & PWM_BIT_CTRL_SET) >> PWM_SHIFT_CTRL_SET == 0) {
			break;  // break the for loop
		} else {
			hal_rtl_misc_delay_us(1);
		}
	}
}

/**
 *  \brief To set the tick time (resolution) of a PWM device.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] tick_p5us The PWM tick time, unit is 500ns. It should be a even number.
 *
 *  \returns HAL_OK: Setting succeed.
 *  \returns HAL_BUSY: Busy.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_tick_time(hal_pwm_adapter_t *ppwm_adp, u32 tick_p5us)
{
	pwm_id_t pwm_id;
	hal_pwm_adapter_t *ptmp_pwm_adp;
	pwm_clk_sel_t pwm_clk_sel = PwmClkSrc_None;
	pwm_clk_sel_t gtimer_to_disable = PwmClkSrc_None;


