swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
	if ((ppwm_adp->pwm_clk_sel != PwmClkSrc_None) && (ppwm_adp->tick_p5us == tick_p5us)) {
		// same as current setting, just skip it
		return HAL_OK;
	}

	if ((ppwm_adp->pwm_clk_sel != PwmClkSrc_None) && (ppwm_adp->pwm_clk_sel != PwmClkSrc_SClk)) {
		// a G-timer has been assign to this PWM already, we should free this timer and reallocate a new timer
		for (pwm_id = 0; pwm_id < MaxPwmNum; pwm_id++) {
			ptmp_pwm_adp = ppwm_comm_adapter->pwm_adapter[pwm_id];
			if ((ptmp_pwm_adp != NULL) && (ptmp_pwm_adp != ppwm_adp)) {
				if (ptmp_pwm_adp->pwm_clk_sel == ppwm_adp->pwm_clk_sel) {
					//dbg_printf("s2.5\r\n");
					// other PWM still using the same G-Timer, cannot disable this timer
					break;  // break for loop
				}
			}
		}
		if (pwm_id == MaxPwmNum) {
			// no other PWM use the same G-timer, so we can disable it
//            hal_timer_event_deinit_rtl8195bhp (ppwm_adp->pwm_clk_sel);
#if Pro2
			gtimer_to_disable = ppwm_adp->pwm_clk_sel;
#else
			gtimer_to_disable = ppwm_adp->pwm_clk_sel + 8;
#endif
			ppwm_adp->pwm_clk_sel = PwmClkSrc_None;
		}
	}

	if (tick_p5us >= 1) {
		// tick duration > 0.5us, so use a GTimer as the tick source
		// search other PWM's tick source, to check is it possable to share the same tick source
		tick_p5us = (tick_p5us + 1) & 0xFFFFFFFE;   // make it as an even number
		for (pwm_id = 0; pwm_id < MaxPwmNum; pwm_id++) {
			ptmp_pwm_adp = ppwm_comm_adapter->pwm_adapter[pwm_id];
			if ((ptmp_pwm_adp != NULL) && (ptmp_pwm_adp != ppwm_adp) && (ptmp_pwm_adp->pwm_clk_sel != PwmClkSrc_None) && (ptmp_pwm_adp->tick_p5us != 0)) {
				if ((ptmp_pwm_adp->tick_p5us <= tick_p5us) && ((tick_p5us % ptmp_pwm_adp->tick_p5us) == 0)) {
					if ((((ppwm_adp->period_us << 1) / ptmp_pwm_adp->tick_p5us) - 1) <= 4095) { // prevent period counter over 12-bits
						// we can share this tick source
						ppwm_adp->tick_p5us = ptmp_pwm_adp->tick_p5us;
						pwm_clk_sel = ptmp_pwm_adp->pwm_clk_sel;
						break;  // break for loop
					}
				}
			}
		}
		if (pwm_id == MaxPwmNum) {
			// cannot share tick source with other PWM, allocate a new G-Timer
			hal_timer_adapter_t timer_adp;
			u32 tick_us;

			tick_us = (tick_p5us >> 1);
			pwm_clk_sel = hal_rtl_timer_event_init(&timer_adp, &tick_us, ppwm_comm_adapter->timer_list);

			if (pwm_clk_sel <= PwmClkSrc_Tm7) {
				tick_p5us = tick_us << 1;
				ppwm_adp->tick_p5us = tick_p5us;
				//dbg_printf("PwmClkSrc_Tm7\r\n");
			} else {
				// GTimer allocation failed, use SCLK
				ppwm_adp->tick_p5us = 1;
				pwm_clk_sel = PwmClkSrc_SClk;
			}
		}
	} else {
		// it should use the SClk as the tick source
		ppwm_adp->tick_p5us = 1;
		pwm_clk_sel = PwmClkSrc_SClk;
		pwm_clk_sel = pwm_clk_sel - 8;
	}

	if (pwm_clk_sel != PwmClkSrc_None) {
		hal_rtl_pwm_set_clk_sel(ppwm_adp, pwm_clk_sel);
	} else {
		return HAL_BUSY;
	}

	if ((gtimer_to_disable != PwmClkSrc_None) && (gtimer_to_disable < PwmClkSrc_SClk)) {
		hal_rtl_timer_event_deinit(gtimer_to_disable);
	}
	//dbg_printf("4\r\n");
	return HAL_OK;
}

/**
 *  \brief To set the duty ratio of the PWM
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] period_us The PWM cycle period, unit is us
 *  \param[in] duty_us The PWM on duty duration, unit is us
 *  \param[in] start_offset_us The on duty start timing offset from the start of the PWM periodof, unit is us
 *
 *  \returns HAL_OK: Setting succeed.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_duty(hal_pwm_adapter_t *ppwm_adp, u32 period_us,
								  u32 duty_us, u32 start_offset_us)
{
	u32 ticks_p5us; // how many 0.5us of 1 tick
	u32 period_test; // Pre-Calculated Period value
	u32 period_pre; //  save default period_us
	hal_status_t ret;
	u8 pwm_enabled;
	//pwm_ctrl_t pwm_ctrl;

	if ((period_us != ppwm_adp->period_us) || (ppwm_adp->pwm_clk_sel == PwmClkSrc_None)) {
		// Period changed or Tick source not set yet
		// we devide a PWM cycle as 4000 ticks, since period counter only has 12-bits
		ticks_p5us = period_us * 2 / 4000;
		if (ticks_p5us == 0) {
			ticks_p5us = 1;
		}

		if (ppwm_adp->duty_res_us != 0) {
			ticks_p5us = ppwm_adp->duty_res_us << 1; // unit is 0.5 us
		}

		while (1) {
			if (period_us == 0) {
				break;
			} else {
				period_test = (((period_us << 1) / ticks_p5us) - 1);
			}
			if (period_test > 4095) { // prevent period counter over 12-bits
				ticks_p5us = ticks_p5us + 1;
			} else {
				break;
			}
		}
		period_pre = ppwm_adp->period_us; // save default period_us
		ppwm_adp->period_us = period_us;

		if ((ticks_p5us != ppwm_adp->tick_p5us) || (ppwm_adp->pwm_clk_sel == PwmClkSrc_None)) {
			ret = hal_rtl_pwm_set_tick_time(ppwm_adp, ticks_p5us);
			if (ret != HAL_OK) {
				ppwm_adp->period_us = period_pre; // return default value
				DBG_PWM_ERR("hal_rtl_pwm_set_duty: set tick time = %u err(%d)\r\n", ticks_p5us, ret);
				return ret;
			}
		}
	}

	ticks_p5us = ppwm_adp->tick_p5us;
	//pwm_ctrl.w = ppwm_adp->base_addr->ctrl;
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 PWM_CTRL;
	PWM_CTRL = PWM_OBJ->PWM_CTRL;
	pwm_enabled = hal_rtl_pwm_enable_sts(ppwm_adp);
	//dbg_printf("enable_sts %x\r\n", pwm_enabled);
	if (pwm_enabled) {
		hal_rtl_pwm_wait_ctrl_ready(ppwm_adp);
	}

	hal_rtl_pwm_set_period(ppwm_adp, (((period_us << 1) / ticks_p5us) - 1));
	hal_rtl_pwm_set_onduty_start(ppwm_adp, ((start_offset_us << 1) / ticks_p5us));
//    hal_pwm_set_duty_size_rtl8195bhp (ppwm_adp, ((duty_us << 1) / ticks_p5us));
	//pwm_ctrl.b.duty = (duty_us << 1) / ticks_p5us;
	PWM_CTRL &= (~PWM_MASK_DUTY);
	PWM_CTRL |= (duty_us << 1) / ticks_p5us;
	if (pwm_enabled) {
		//pwm_ctrl.b.ctrl_set = 1;
		PWM_CTRL |= PWM_BIT_CTRL_SET;
	}
	//ppwm_adp->base_addr->ctrl = pwm_ctrl.w;
	PWM_OBJ->PWM_CTRL = PWM_CTRL;
	ppwm_adp->period_us = period_us;
	ppwm_adp->duty_us = duty_us;



	return HAL_OK;
}

/**
 *  \brief To read the time period of current duty of the PWM
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns u32: The PWM on duty duration, unit is us
 */
SECTION_PWM_TEXT
u32 hal_rtl_pwm_read_duty(hal_pwm_adapter_t *ppwm_adp)
{
	//pwm_comm_indread_idx_t pwm_indrd_idx;
	u32 duty_ticks;
	u32 duty_us;
	u32 i = 0;

