swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	u32 PWM_INDRD_IDX;
	PWM_INDRD_IDX = 0;

	//PWM_INDRD_IDX &= (~PWM_COMM_MASK_PWM_SEL);

	PWM_INDRD_IDX |= (PWM_COMM_MASK_PWM_SEL & (ppwm_adp->pwm_id));

	PWM_INDRD_IDX |= PWM_COMM_BIT_POOL;
	PWM_INDRD_IDX |= PWM_COMM_BIT_SYNC_MODE;

	PWM_COMM_OBJ->PWM_COMM_INDREAD_IDX = PWM_INDRD_IDX;

//    pwm_indrd_idx.w = 0;
//    pwm_indrd_idx.b.pwm_sel = ppwm_adp->pwm_id;
//    pwm_indrd_idx.b.pool = 1; // enable in-direct read
//    pwm_indrd_idx.b.sync_mode = 1; // in-direct read sync mode

	//ppwm_comm_adapter->base_addr->indread_idx = pwm_indrd_idx.w;
	while (((PWM_COMM_OBJ->PWM_COMM_INDREAD_IDX & PWM_COMM_BIT_POOL) >> PWM_COMM_SHIFT_POOL) == 1) {      // wait HW ready
		hal_rtl_misc_delay_us(1);
		i++;
		if (i > 1000000) {
			DBG_PWM_ERR("hal_pwm_read_duty: Wait indirect-read ready timeout\r\n");
			break;
		}
	}
	duty_ticks = PWM_COMM_OBJ->PWM_COMM_INDREAD_DUTY & PWM_COMM_MASK_PWM_DUTY;
	//duty_ticks = ppwm_comm_adapter->base_addr->indread_duty_b.pwm_duty;
	duty_us = (duty_ticks * ppwm_adp->tick_p5us) >> 1;

	// read the PWM duty tick count by in-direct reading

	return (duty_us);
}

/**
 *  \brief To change the duty ratio of the PWM only and keep other setting.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] duty_us The PWM on duty duration, unit is us
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_change_duty(hal_pwm_adapter_t *ppwm_adp, u32 duty_us)
{
	u32 ticks_p5us; // how many 0.5us of 1 tick
	u8 pwm_enabled;
	//pwm_ctrl_t pwm_ctrl;

	ticks_p5us = ppwm_adp->tick_p5us;
	pwm_enabled = hal_rtl_pwm_enable_sts(ppwm_adp);
	if (pwm_enabled) {
		hal_rtl_pwm_wait_ctrl_ready(ppwm_adp);
	}
	u32 PWM_CTRL;
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	PWM_CTRL = PWM_OBJ->PWM_CTRL;
	PWM_CTRL &= (~PWM_MASK_DUTY);
	PWM_CTRL |= (duty_us << 1) / ticks_p5us;

	if (pwm_enabled) {
		PWM_CTRL |= PWM_BIT_CTRL_SET;
	}
	PWM_OBJ->PWM_CTRL = PWM_CTRL;
	ppwm_adp->duty_us = duty_us;

}

/**
 *  \brief To set the PWM on duty boundary (up limit / down limit) of the duty
 *         auto-adjustment.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_us The up limit of the duty time, in us.
 *  \param[in] min_duty_us The down limit of the duty time, in us.
 *
 *  \returns HAL_OK: Setting succeed.
 *  \returns HAL_ERR_PARA: Error with invaild parameters.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_duty_limit(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_us, u32 min_duty_us)
{
	u32 tick_p5us;  // how many 0.5us of 1 tick

	if (min_duty_us > max_duty_us) {
		DBG_PWM_ERR("hal_pwm_set_duty_limit: dn-limit(%u) > up-limit(%u)\r\n", min_duty_us, max_duty_us);
		return HAL_ERR_PARA;
	}

	if ((ppwm_adp->duty_us < min_duty_us) || (ppwm_adp->duty_us > max_duty_us)) {
		DBG_PWM_ERR("hal_pwm_set_duty_limit: current duty(%u) is not in this range\r\n", ppwm_adp->duty_us);
		return HAL_ERR_PARA;
	}

	tick_p5us = ppwm_adp->tick_p5us;

	// Set the up limit, in ticks
	hal_rtl_pwm_set_max_duty(ppwm_adp, ((max_duty_us << 1) / tick_p5us));
	// Set the down limit, in ticks
	hal_rtl_pwm_set_min_duty(ppwm_adp, (min_duty_us << 1) / tick_p5us);
	return HAL_OK;
}

/**
 *  \brief To setup the PWM duty auto-adjustment registers.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] pauto_duty The duty auto-adjustment configuration. Includes maximum / minum duty size, duty
 *                    increasing / decreasing step size, adjustment period and the callback function for
 *                    the adjustment done indication.
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_set_auto_duty_adj(hal_pwm_adapter_t *ppwm_adp, hal_pwm_auto_duty_adj_t *pauto_duty)
{
	u32 tick_p5us; // how many 0.5us of 1 tick
	u32 cycle_cnt;
	//pwm_auto_adj_ctrl_t pwm_adj_ctrl;
	//pwm_auto_adj_limit_t pwm_adj_lim;

	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 PWM_ADJ_LIM, PWM_ADJ_CTRL;

	tick_p5us = ppwm_adp->tick_p5us;

	PWM_ADJ_LIM = 0;
	PWM_ADJ_CTRL = PWM_OBJ->PWM_AUTO_ADJ_CTRL;
	//pwm_adj_lim.w = 0;
	//pwm_adj_ctrl.w = ppwm_adp->base_addr->auto_adj_ctrl;
	PWM_ADJ_LIM = (PWM_ADJ_LIM | PWM_MASK_DUTY_ADJ_UP_LIM) & (((pauto_duty->max_duty_us << 1) / tick_p5us) << PWM_SHIFT_DUTY_ADJ_UP_LIM);
	PWM_ADJ_LIM = (PWM_ADJ_LIM | PWM_MASK_DUTY_ADJ_DN_LIM) & (((pauto_duty->min_duty_us << 1) / tick_p5us) << PWM_SHIFT_DUTY_ADJ_DN_LIM);

//    pwm_adj_lim.b.duty_adj_up_lim = (pauto_duty->max_duty_us << 1) / tick_p5us;
//    pwm_adj_lim.b.duty_adj_dn_lim = (pauto_duty->min_duty_us << 1) / tick_p5us;

	//ppwm_adp->base_addr->auto_adj_limit = pwm_adj_lim.w;
	PWM_OBJ->PWM_AUTO_ADJ_LIMIT = PWM_ADJ_LIM;


	if (pauto_duty->step_period_cnt > 1) {
		cycle_cnt = pauto_duty->step_period_cnt - 1;    // HW cycle count = cycle count - 1;
	} else {
		cycle_cnt = 0;
	}

	hal_rtl_pwm_set_duty_adj_cycle(ppwm_adp, cycle_cnt);

	PWM_ADJ_CTRL |= (PWM_MASK_DUTY_DEC_STEP & (((pauto_duty->duty_dec_step_us << 1) / tick_p5us) << PWM_SHIFT_DUTY_DEC_STEP));
	PWM_ADJ_CTRL |= (PWM_MASK_DUTY_INC_STEP & (((pauto_duty->duty_inc_step_us << 1) / tick_p5us) << PWM_SHIFT_DUTY_INC_STEP));
	if (pauto_duty->init_dir == 1) {
		PWM_ADJ_CTRL = PWM_ADJ_CTRL | PWM_BIT_ADJ_DIR;
	} else {
		PWM_ADJ_CTRL = PWM_ADJ_CTRL & (~PWM_BIT_ADJ_DIR);
	}

//    pwm_adj_ctrl.b.duty_dec_step = (pauto_duty->duty_dec_step_us << 1) / tick_p5us;
//    pwm_adj_ctrl.b.duty_inc_step = (pauto_duty->duty_inc_step_us << 1) / tick_p5us;
//    pwm_adj_ctrl.b.adj_dir = pauto_duty->init_dir;

	if (pauto_duty->loop_mode) {
		PWM_ADJ_CTRL = PWM_ADJ_CTRL | PWM_BIT_ADJ_LOOP_EN;
	} else {
		PWM_ADJ_CTRL = PWM_ADJ_CTRL & (~PWM_BIT_ADJ_LOOP_EN);
	}

//    if (pauto_duty->loop_mode) {
//        pwm_adj_ctrl.b.adj_loop_en = 1;
//    } else {
//        pwm_adj_ctrl.b.adj_loop_en = 0;
//    }

	PWM_OBJ->PWM_AUTO_ADJ_CTRL = PWM_ADJ_CTRL;

	// write the duty auto-adjustment control register
	//ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;


}

/**
 *  \brief To enable or disable the PWM duty auto-adjustment HW.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] enable The duty auto-adjustment enable control (0: disable, 1: enable)
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_auto_duty_en(hal_pwm_adapter_t *ppwm_adp, BOOLEAN enable)
{
	//pwm_auto_adj_ctrl_t pwm_adj_ctrl;
	hal_pwm_auto_duty_adj_t *duty_adj;

	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	duty_adj = &(ppwm_adp->duty_adj);
	u32 PWM_ADJ_CTRL;
	PWM_ADJ_CTRL = PWM_OBJ->PWM_AUTO_ADJ_CTRL;

	if (enable) {
		PWM_ADJ_CTRL &= (~PWM_BIT_DUTY_UP_LIM_IE);
		PWM_ADJ_CTRL &= (~PWM_BIT_DUTY_DN_LIM_IE);
//        pwm_adj_ctrl.b.duty_up_lim_ie = 0;
//        pwm_adj_ctrl.b.duty_dn_lim_ie = 0;


		if (duty_adj->loop_mode == PwmDutyLoopOff) {
			if (duty_adj->init_dir) {
				PWM_ADJ_CTRL |= (PWM_BIT_DUTY_UP_LIM_IE);
				//pwm_adj_ctrl.b.duty_up_lim_ie = 1;
			} else {
				PWM_ADJ_CTRL |= (PWM_BIT_DUTY_DN_LIM_IE);
				//pwm_adj_ctrl.b.duty_dn_lim_ie = 1;
			}
		} else if (duty_adj->loop_mode == PwmDutyLoopForever) {
			if (ppwm_adp->adj_int_en & PwmAdjIntUpLim) {
				PWM_ADJ_CTRL |= (PWM_BIT_DUTY_UP_LIM_IE);
				//pwm_adj_ctrl.b.duty_up_lim_ie = 1;
			}

