swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
			if (ppwm_adp->adj_int_en & PwmAdjIntDnLim) {
				PWM_ADJ_CTRL |= (PWM_BIT_DUTY_DN_LIM_IE);
				//pwm_adj_ctrl.b.duty_dn_lim_ie = 1;
			}
		} else if (duty_adj->loop_mode == PwmDutyLoopCnt) {
			if (duty_adj->init_dir) {
				PWM_ADJ_CTRL |= (PWM_BIT_DUTY_UP_LIM_IE);
				PWM_ADJ_CTRL &= (~PWM_BIT_DUTY_DN_LIM_IE);
//                pwm_adj_ctrl.b.duty_up_lim_ie = 1;
//                pwm_adj_ctrl.b.duty_dn_lim_ie = 0;
			} else {
				PWM_ADJ_CTRL &= (~PWM_BIT_DUTY_UP_LIM_IE);
				PWM_ADJ_CTRL |= (PWM_BIT_DUTY_DN_LIM_IE);
//                pwm_adj_ctrl.b.duty_up_lim_ie = 0;
//                pwm_adj_ctrl.b.duty_dn_lim_ie = 1;
			}
		}
		PWM_ADJ_CTRL |= PWM_BIT_ADJ_EN;
		//pwm_adj_ctrl.b.adj_en = 1;
	} else {
		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_EN);
		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_LOOP_EN);
//        pwm_adj_ctrl.b.adj_en = 0;
//        pwm_adj_ctrl.b.adj_loop_en = 0;
	}
	PWM_OBJ->PWM_AUTO_ADJ_CTRL = PWM_ADJ_CTRL;
	//ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;


}

/**
 *  \brief To configure the PWM duty auto-adjustment for duty duration increasing.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_us The up limit of the duty duration, in us.
 *  \param[in] step_sz_us The step size of each duty duration increasing, in us.
 *  \param[in] step_period_cnt The stay time of each duty duration increasing step, uint is PWM period.
 *
 *  \returns HAL_OK: Setting succeed.
 *  \returns HAL_ERR_PARA: Error with invaild parameters.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_auto_duty_inc(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_us,
		u32 step_sz_us, u32 step_period_cnt)
{
	hal_pwm_auto_duty_adj_t *pauto_duty;

	if ((max_duty_us > ppwm_adp->period_us)) {
		DBG_PWM_ERR("hal_pwm_auto_duty_inc: max_duty_us(%u) over period(%u)\r\n",
					max_duty_us, ppwm_adp->period_us);
		return HAL_ERR_PARA;
	}

	pauto_duty = &(ppwm_adp->duty_adj);
	pauto_duty->max_duty_us = max_duty_us;
	pauto_duty->duty_inc_step_us = step_sz_us;
	pauto_duty->step_period_cnt = step_period_cnt;
	pauto_duty->loop_mode = PwmDutyLoopOff;
	pauto_duty->init_dir = PwmDutyAdj_Increase;
	hal_rtl_pwm_set_auto_duty_adj(ppwm_adp, pauto_duty);

	return HAL_OK;
}

/**
 *  \brief To configure the PWM duty auto-adjustment for duty duration increasing.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_us The up limit of the duty duration, in us.
 *  \param[in] step_sz_us The step size of each duty duration increasing, in us.
 *  \param[in] step_period_cnt The stay time of each duty duration increasing step, uint is PWM period.
 *
 *  \returns HAL_OK: Setting succeed.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_auto_duty_dec(hal_pwm_adapter_t *ppwm_adp, u32 min_duty_us,
		u32 step_sz_us, u32 step_period_cnt)
{
	hal_pwm_auto_duty_adj_t *pauto_duty;

	pauto_duty = &(ppwm_adp->duty_adj);
//    auto_duty.max_duty_us = ppwm_adp->period_us;
	pauto_duty->min_duty_us = min_duty_us;
	pauto_duty->duty_dec_step_us = step_sz_us;
	pauto_duty->step_period_cnt = step_period_cnt;
	pauto_duty->loop_mode = PwmDutyLoopOff;
	pauto_duty->init_dir = PwmDutyAdj_Decrease;
	hal_rtl_pwm_set_auto_duty_adj(ppwm_adp, pauto_duty);

	return HAL_OK;
}

/**
 *  \brief To configure the PWM duty auto-adjustment loop mode.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] ini_dir The initial direction for the duty-adjustment loop. 1 -> duty increasing, 0 -> duty decreasing.
 *  \param[in] loop_cnt The number of duty-adjustment loop to run. 1 loop means from min duty to max duty
 *                  or from max duty to min duty.
 *
 *  \returns HAL_OK: Setting succeed.
 *  \returns HAL_ERR_PARA: Error with invaild parameters.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_auto_duty_loop(hal_pwm_adapter_t *ppwm_adp, u8 ini_dir, u32 loop_cnt)
{
	hal_pwm_auto_duty_adj_t *pauto_duty;

	pauto_duty = &(ppwm_adp->duty_adj);

	if ((pauto_duty->min_duty_us >= pauto_duty->max_duty_us) ||
		(pauto_duty->max_duty_us > ppwm_adp->period_us)) {
		DBG_PWM_ERR("hal_pwm_auto_duty_loop: invalid cfg:  max_duty_us(%u) min_duty_us(%u) period(%u)\r\n",
					pauto_duty->max_duty_us, pauto_duty->min_duty_us, ppwm_adp->period_us);
		return HAL_ERR_PARA;
	}

	if (ini_dir) {
		pauto_duty->init_dir = PwmDutyAdj_Increase;
	} else {
		pauto_duty->init_dir = PwmDutyAdj_Decrease;
	}
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

	if (ini_dir == 1) {
		PWM_OBJ->PWM_AUTO_ADJ_CTRL |= PWM_BIT_ADJ_DIR;
	} else {
		PWM_OBJ->PWM_AUTO_ADJ_CTRL &= (~PWM_BIT_ADJ_DIR);
	}

	//ppwm_adp->base_addr->auto_adj_ctrl_b.adj_dir = ini_dir;

	if (loop_cnt > 0) {
		ppwm_adp->adj_loop_count = loop_cnt - 1;
		ppwm_adp->duty_adj.loop_mode = PwmDutyLoopCnt;
		if (ppwm_adp->adj_loop_count > 0) {
			PWM_OBJ->PWM_AUTO_ADJ_CTRL |= PWM_BIT_ADJ_LOOP_EN;
			//ppwm_adp->base_addr->auto_adj_ctrl_b.adj_loop_en = 1;
		}
	} else {
		ppwm_adp->duty_adj.loop_mode = PwmDutyLoopForever;
		PWM_OBJ->PWM_AUTO_ADJ_CTRL |= PWM_BIT_ADJ_LOOP_EN;
		//ppwm_adp->base_addr->auto_adj_ctrl_b.adj_loop_en = 1;
	}

	return HAL_OK;


}

/**
 *  \brief To enable the PWM period end interrupt.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] callback The callback function. It will be called when the interrupt is accurred.
 *  \param[in] arg The argument of the callback function.
 *  \param[in] int_en To enable(1) or disable(0) the interrupt. For interrupt disable, the arguments
 *                'callback' & 'arg' are ignored.
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_set_period_int(hal_pwm_adapter_t *ppwm_adp, pwm_period_callback_t callback, void *arg, u8 int_en)
{

	if (int_en) {
		if (callback != NULL) {
			ppwm_adp->period_callback = callback;
			ppwm_adp->pe_cb_para = arg;

			hal_rtl_pwm_set_period_ie(ppwm_adp, 1);
		}
	} else {
		hal_rtl_pwm_set_period_ie(ppwm_adp, 0);
	}
}

/**
 *  \brief To setup the PWM duty auto adjustment interrupt.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] callback The callback function. It will be called when the interrupt is accurred.
 *  \param[in] arg The argument of the callback function.
 *  \param[in] int_en The bit map to enable/disable the interrupt. Bit 0 control the interrupt of
 *                duty duration reachs the down limit. Bit 1 control the interrupt of duty duration
 *                reachs the up limit.
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_set_autoadj_int(hal_pwm_adapter_t *ppwm_adp,
								 pwm_lim_callback_t callback, void *arg, u8 int_en)
{
	if (callback != NULL) {
		ppwm_adp->bound_callback = callback;
		ppwm_adp->bound_cb_para = arg;
	}

	ppwm_adp->adj_int_en = int_en;
}

/**
 *  \brief To setup the PWM duty auto adjustment interrupt callback for loop mode.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] callback The callback function. It will be called when the duty adjustment loop count down to 0.
 *  \param[in] arg The argument of the callback function.
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_set_autoadj_loop_int(hal_pwm_adapter_t *ppwm_adp,
									  pwm_lo_callback_t callback, void *arg)
{
	ppwm_adp->loopout_callback = callback;
	ppwm_adp->lo_cb_para = arg;
}

/**
 *  \brief To start the PWM duty auto-adjustment for duty duration increasing.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_us The up limit of the duty duration, in us.
 *  \param[in] step_sz_us The step size of each duty duration increasing, in us.
 *  \param[in] step_period_cnt The stay time of each duty duration increasing step, uint is PWM period.
 *
 *  \return     HAL_OK:  Setting succeed.
 *  \return     HAL_BUSY:  BUSY.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_auto_duty_inc(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_us,
									   u32 step_sz_us, u32 step_period_cnt)
{
	hal_status_t result;

	if ((hal_rtl_pwm_enable_sts(ppwm_adp)) && ((ppwm_adp->base_addr->PWM_AUTO_ADJ_CTRL & PWM_BIT_ADJ_EN) >> 31)) {
		DBG_PWM_WARN("PWM%u is busy\r\n", ppwm_adp->pwm_id);
		return HAL_BUSY;
	}

	result = hal_rtl_pwm_set_auto_duty_inc(ppwm_adp, max_duty_us, step_sz_us, step_period_cnt);
	if (result == HAL_OK) {
		hal_rtl_pwm_auto_duty_en(ppwm_adp, 1);
	}

	return result;
}

/**
 *  \brief To start the PWM duty auto-adjustment for duty duration increasing.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_us The up limit of the duty duration, in us.
 *  \param[in] step_sz_us The step size of each duty duration increasing, in us.
 *  \param[in] step_period_cnt The stay time of each duty duration increasing step, uint is PWM period.
 *
 *  \return     HAL_OK:  Setting succeed.
 *  \return     HAL_BUSY:  BUSY.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_auto_duty_dec(hal_pwm_adapter_t *ppwm_adp, u32 min_duty_us,
									   u32 step_sz_us, u32 step_period_cnt)
{
	hal_status_t result;

	if ((hal_rtl_pwm_enable_sts(ppwm_adp)) && ((ppwm_adp->base_addr->PWM_AUTO_ADJ_CTRL & PWM_BIT_ADJ_EN) >> 31)) {
		DBG_PWM_WARN("PWM%u is busy\r\n", ppwm_adp->pwm_id);
		return HAL_BUSY;
	}

	result = hal_rtl_pwm_set_auto_duty_dec(ppwm_adp, min_duty_us, step_sz_us, step_period_cnt);
	if (result == HAL_OK) {
		hal_rtl_pwm_auto_duty_en(ppwm_adp, 1);
	}

	return result;
}

/**
 *  \brief To start the PWM duty auto-adjustment loop mode.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] ini_duty_us The initial value for the loop-mode auto duty adjustment. If this value is 0xFFFFFFFF
 *                       it means use current duty as the initial duty.
 *  \param[in] ini_dir The initial direction for the duty-adjustment loop. 1 -> duty increasing, 0 -> duty decreasing.
 *  \param[in] loop_cnt The number of duty-adjustment loop to run. 1 loop means from min duty to max duty
 *                  or from max duty to min duty.
 *
 *  \return     HAL_OK:  Setting succeed.
 *  \return     HAL_BUSY:  BUSY.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_auto_duty_loop(hal_pwm_adapter_t *ppwm_adp, u32 ini_duty_us, u8 ini_dir, u32 loop_cnt)
{
	hal_status_t result;

	if ((hal_rtl_pwm_enable_sts(ppwm_adp)) && ((ppwm_adp->base_addr->PWM_AUTO_ADJ_CTRL & PWM_BIT_ADJ_EN) >> 31)) {
		DBG_PWM_WARN("PWM%u is busy\r\n", ppwm_adp->pwm_id);
		return HAL_BUSY;
	}

