swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
	result = hal_rtl_pwm_set_auto_duty_loop(ppwm_adp, ini_dir, loop_cnt);
	if (result == HAL_OK) {
		if ((ini_duty_us <= ppwm_adp->period_us) && (ini_duty_us != PWM_CURRENT_DUTY)) {
			hal_rtl_pwm_change_duty(ppwm_adp, ini_duty_us);
		}
		hal_rtl_pwm_auto_duty_en(ppwm_adp, 1);
	}

	return result;
}

/**
 *  \brief To stop the PWM duty auto-adjustment loop mode.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] stop_now Is stop the PWM auto duty loop immediately(1) or stop at the next duty limit(0).
 *
 *  \returns void
 */
SECTION_PWM_TEXT
void hal_rtl_pwm_stop_duty_loop(hal_pwm_adapter_t *ppwm_adp, u8 stop_now)
{
	//pwm_auto_adj_ctrl_t pwm_adj_ctrl;

	if ((ppwm_adp->duty_adj.loop_mode == PwmDutyLoopOff) ||
		((ppwm_adp->duty_adj.loop_mode == PwmDutyLoopCnt) && (ppwm_adp->adj_loop_count <= 1))) {
		return;
	}

	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 PWM_ADJ_CTRL;
	PWM_ADJ_CTRL = PWM_OBJ->PWM_AUTO_ADJ_CTRL;
	//pwm_adj_ctrl.w = ppwm_adp->base_addr->auto_adj_ctrl;

	if (stop_now) {
		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_LOOP_EN);
		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_EN);
		//pwm_adj_ctrl.b.adj_loop_en = 0;
		//pwm_adj_ctrl.b.adj_en = 0;
		// Disable Interrupt
		PWM_ADJ_CTRL &= (~PWM_BIT_DUTY_DN_LIM_IE);
		PWM_ADJ_CTRL &= (~PWM_BIT_DUTY_UP_LIM_IE);
		//pwm_adj_ctrl.b.duty_dn_lim_ie = 0;
		//pwm_adj_ctrl.b.duty_up_lim_ie = 0;
	} else {
		ppwm_adp->adj_loop_count = 1;
		ppwm_adp->duty_adj.loop_mode = PwmDutyLoopCnt;

//        pwm_adj_ctrl.b.adj_loop_en = 0;
		// enable interrupt and then stop auto duty adjustment in ISR
		PWM_ADJ_CTRL |= PWM_BIT_DUTY_DN_LIM_IE;
		PWM_ADJ_CTRL |= PWM_BIT_DUTY_UP_LIM_IE;

//        pwm_adj_ctrl.b.duty_dn_lim_ie = 1;
//        pwm_adj_ctrl.b.duty_up_lim_ie = 1;
	}
	PWM_OBJ->PWM_AUTO_ADJ_CTRL = PWM_ADJ_CTRL;
	//ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;


}

/**
 *  \brief To set the duty(ns) ratio of the PWM.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] period_ns The PWM cycle period, unit is ns
 *  \param[in] duty_ns The PWM on duty duration, unit is ns
 *  \param[in] start_offset_ns The on duty start timing offset from the start of the PWM periodof, unit is ns
 *
 *  \returns HAL_OK: Setting succeed.
 *  \returns HAL_NOT_READY: Error with data not ready.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_set_duty_ns(hal_pwm_adapter_t *ppwm_adp, u32 period_ns,
									 u32 duty_ns, u32 start_offset_ns)
{

	u32 ticks_50ns; // how many 0.5us of 1 tick
	u8 pwm_enabled;
	//pwm_ctrl_t pwm_ctrl;
	ticks_50ns = 50;
	if (ppwm_comm_adapter == NULL) {
		return HAL_NOT_READY;
	}

	if (ptimer_group2->sclk_idx == 1) {
		if (period_ns > 204750) {
			DBG_PWM_ERR("hal_rtl_pwm_set_duty_ns: The period_ns can't be larger than 204750ns\r\n");
			return HAL_NOT_READY;
		} else if (period_ns < 100) {
			DBG_PWM_ERR("hal_rtl_pwm_set_duty_ns: The period_ns can't be less than 100ns\r\n");
			return HAL_NOT_READY;
		} else {
			hal_rtl_pwm_set_clk_sel(ppwm_adp, 8);  // Assign SCLK
			PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
			u32 PWM_CTRL;
			PWM_CTRL = PWM_OBJ->PWM_CTRL;
			//pwm_ctrl.w = ppwm_adp->base_addr->ctrl;
			pwm_enabled = hal_rtl_pwm_enable_sts(ppwm_adp);
			if (pwm_enabled) {
				hal_rtl_pwm_wait_ctrl_ready(ppwm_adp);
			}
			hal_rtl_pwm_set_period(ppwm_adp, (((period_ns) / ticks_50ns) - 1));
			hal_rtl_pwm_set_onduty_start(ppwm_adp, ((start_offset_ns) / ticks_50ns));
			PWM_CTRL &= (~PWM_MASK_DUTY);
			PWM_CTRL |= (duty_ns) / ticks_50ns;
			//pwm_ctrl.b.duty = (duty_ns) / ticks_50ns;
			//DBG_PWM_ERR ("Duty: %d\r\n",pwm_ctrl.b.duty);

			if (pwm_enabled) {
				PWM_CTRL &= (~PWM_BIT_CTRL_SET);
				//pwm_ctrl.b.ctrl_set = 1;
			}
			ppwm_adp->tick_p5us = ticks_50ns / 5000;
			PWM_OBJ->PWM_CTRL = PWM_CTRL;
			//ppwm_adp->base_addr->ctrl = pwm_ctrl.w;
			ppwm_adp->period_us = period_ns / 1000;
			ppwm_adp->duty_us = duty_ns / 1000;
		}
	} else {
		DBG_PWM_ERR("hal_rtl_pwm_set_duty_ns: The timer group1 should be set 20MHz\r\n");
		return HAL_NOT_READY;
	}

	return HAL_OK;


}


/**
 *  \brief To start the PWM duty auto-adjustment for duty duration increasing.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_ns The up limit of the duty duration, in ns.
 *  \param[in] step_sz_ns The step size of each duty duration increasing, in ns.
 *  \param[in] step_period_cnt The stay time of each duty duration increasing step, uint is PWM period.
 *
 *  \returns     HAL_OK:  Setting succeed.
 *  \returns     HAL_BUSY:  BUSY.
 *  \returns     HAL_NOT_READY: Error with data not ready.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_auto_duty_ns_inc(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_ns,
		u32 step_sz_ns, u32 step_period_cnt)
{
	hal_status_t result;
	u32 tick_ns; // how many 0.5us of 1 tick
	u32 cycle_cnt;
	//pwm_auto_adj_ctrl_t pwm_adj_ctrl;
	//pwm_auto_adj_limit_t pwm_adj_lim;
	hal_pwm_auto_duty_adj_t *pauto_duty;

	if (ptimer_group2->sclk_idx == 1) {
		if ((hal_rtl_pwm_enable_sts(ppwm_adp)) && ((ppwm_adp->base_addr->PWM_AUTO_ADJ_CTRL & PWM_BIT_ADJ_EN) >> 31)) {
			DBG_PWM_WARN("PWM%u is busy\r\n", ppwm_adp->pwm_id);
			return HAL_BUSY;
		}

		//result = hal_pwm_set_auto_duty_inc (ppwm_adp, max_duty_ns, step_sz_ns, step_period_cnt);
		pauto_duty = &(ppwm_adp->duty_adj);
		pauto_duty->max_duty_us = max_duty_ns / 1000;
		pauto_duty->duty_inc_step_us = step_sz_ns / 1000;
		pauto_duty->step_period_cnt = step_period_cnt;
		pauto_duty->loop_mode = PwmDutyLoopOff;
		pauto_duty->init_dir = PwmDutyAdj_Increase;
		tick_ns = 50;

		PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
		u32 PWM_ADJ_LIM, PWM_ADJ_CTRL;
		PWM_ADJ_LIM = 0;
		//pwm_adj_lim.w = 0;
		PWM_ADJ_CTRL = PWM_OBJ->PWM_AUTO_ADJ_CTRL;
		//pwm_adj_ctrl.w = ppwm_adp->base_addr->auto_adj_ctrl;
		PWM_ADJ_LIM |= PWM_MASK_DUTY_ADJ_UP_LIM & ((max_duty_ns / tick_ns) << PWM_SHIFT_DUTY_ADJ_DN_LIM);
		PWM_ADJ_LIM &= (~PWM_MASK_DUTY_ADJ_DN_LIM);


//        pwm_adj_lim.b.duty_adj_up_lim = (max_duty_ns) / tick_ns;
//        pwm_adj_lim.b.duty_adj_dn_lim = 0;
		PWM_OBJ->PWM_AUTO_ADJ_LIMIT = PWM_ADJ_LIM;
		//ppwm_adp->base_addr->auto_adj_limit = pwm_adj_lim.w;


