swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
		if (step_period_cnt > 1) {
			cycle_cnt = step_period_cnt - 1;    // HW cycle count = cycle count - 1;
		} else {
			cycle_cnt = 0;
		}

		hal_rtl_pwm_set_duty_adj_cycle(ppwm_adp, cycle_cnt);

		PWM_ADJ_CTRL |= (PWM_MASK_DUTY_INC_STEP & ((step_sz_ns / tick_ns) << PWM_SHIFT_DUTY_INC_STEP));
		PWM_ADJ_CTRL &= (~PWM_MASK_DUTY_DEC_STEP);

//        pwm_adj_ctrl.b.duty_inc_step = (step_sz_ns) / tick_ns;
//        pwm_adj_ctrl.b.duty_dec_step = 0;
		PWM_ADJ_CTRL |= PWM_BIT_ADJ_DIR;
		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_LOOP_EN);

//        pwm_adj_ctrl.b.adj_dir = PwmDutyAdj_Increase;
//        pwm_adj_ctrl.b.adj_loop_en = PwmDutyLoopOff;

		// write the duty auto-adjustment control register
		PWM_OBJ->PWM_AUTO_ADJ_CTRL = PWM_ADJ_CTRL;
		//ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;
		result = HAL_OK;
		if (result == HAL_OK) {
			hal_rtl_pwm_auto_duty_en(ppwm_adp, 1);
		}
		return result;
	} else {
		DBG_PWM_ERR("hal_rtl_pwm_auto_duty_ns_inc: The timer group1 should be set 20MHz\r\n");
		return HAL_NOT_READY;
	}



}

/**
 *  \brief To start the PWM duty auto-adjustment for duty duration decreasing.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] max_duty_ns The up limit of the duty duration, in ns.
 *  \param[in] step_sz_ns The step size of each duty duration increasing, in ns.
 *  \param[in] step_period_cnt The stay time of each duty duration increasing step, uint is PWM period.
 *
 *  \returns     HAL_OK:  Setting succeed.
 *  \returns     HAL_BUSY:  BUSY.
 *  \returns     HAL_NOT_READY: Error with data not ready.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_auto_duty_ns_dec(hal_pwm_adapter_t *ppwm_adp, u32 min_duty_ns,
		u32 step_sz_ns, u32 step_period_cnt)
{
	hal_status_t result;
	u32 tick_ns; // how many 0.5us of 1 tick
	u32 cycle_cnt;
	//pwm_auto_adj_ctrl_t pwm_adj_ctrl;
	//pwm_auto_adj_limit_t pwm_adj_lim;
	hal_pwm_auto_duty_adj_t *pauto_duty;

	if (ptimer_group2->sclk_idx == 1) {
		if ((hal_rtl_pwm_enable_sts(ppwm_adp)) && ((ppwm_adp->base_addr->PWM_AUTO_ADJ_CTRL & PWM_BIT_ADJ_EN) >> 31)) {
			DBG_PWM_WARN("PWM%u is busy\r\n", ppwm_adp->pwm_id);
			return HAL_BUSY;
		}

		//result = hal_pwm_set_auto_duty_dec (ppwm_adp, min_duty_ns, step_sz_ns, step_period_cnt);

		pauto_duty = &(ppwm_adp->duty_adj);
		pauto_duty->min_duty_us = min_duty_ns / 1000;
		pauto_duty->duty_dec_step_us = step_sz_ns / 1000;
		pauto_duty->step_period_cnt = step_period_cnt;
		pauto_duty->loop_mode = PwmDutyLoopOff;
		pauto_duty->init_dir = PwmDutyAdj_Decrease;

		tick_ns = 50;

		PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
		u32 PWM_ADJ_LIM, PWM_ADJ_CTRL;
		PWM_ADJ_LIM = 0;
		PWM_ADJ_CTRL = PWM_OBJ->PWM_AUTO_ADJ_CTRL;
		PWM_ADJ_LIM |= PWM_MASK_DUTY_ADJ_DN_LIM & ((min_duty_ns / tick_ns) << PWM_SHIFT_DUTY_ADJ_DN_LIM);
		PWM_ADJ_LIM &= (~PWM_MASK_DUTY_ADJ_UP_LIM);

//        pwm_adj_lim.w = 0;
//        pwm_adj_ctrl.w = ppwm_adp->base_addr->auto_adj_ctrl;
//
//        pwm_adj_lim.b.duty_adj_up_lim = 0;
//        pwm_adj_lim.b.duty_adj_dn_lim = (min_duty_ns) / tick_ns;
//        ppwm_adp->base_addr->auto_adj_limit = pwm_adj_lim.w;

		PWM_OBJ->PWM_AUTO_ADJ_LIMIT = PWM_ADJ_LIM;
		if (step_period_cnt > 1) {
			cycle_cnt = step_period_cnt - 1;    // HW cycle count = cycle count - 1;
		} else {
			cycle_cnt = 0;
		}

		hal_rtl_pwm_set_duty_adj_cycle(ppwm_adp, cycle_cnt);


		PWM_ADJ_CTRL |= (PWM_MASK_DUTY_DEC_STEP & ((step_sz_ns / tick_ns) << PWM_SHIFT_DUTY_DEC_STEP));
		PWM_ADJ_CTRL &= (~PWM_MASK_DUTY_INC_STEP);
//        pwm_adj_ctrl.b.duty_inc_step = 0;
//        pwm_adj_ctrl.b.duty_dec_step = (step_sz_ns) / tick_ns;
//        pwm_adj_ctrl.b.adj_dir = PwmDutyAdj_Decrease;
//        pwm_adj_ctrl.b.adj_loop_en = PwmDutyLoopOff;

		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_DIR);
		PWM_ADJ_CTRL &= (~PWM_BIT_ADJ_LOOP_EN);


		// write the duty auto-adjustment control register
		PWM_OBJ->PWM_AUTO_ADJ_CTRL = PWM_ADJ_CTRL;

		// write the duty auto-adjustment control register
		//ppwm_adp->base_addr->auto_adj_ctrl = pwm_adj_ctrl.w;
		result = HAL_OK;
		if (result == HAL_OK) {
			hal_rtl_pwm_auto_duty_en(ppwm_adp, 1);
		}

		return result;
	} else {
		DBG_PWM_ERR("hal_rtl_pwm_auto_duty_ns_dec: The timer group1 should be set 20MHz\r\n");
		return HAL_NOT_READY;
	}


}

/**
 *  \brief To read the time period of current duty of the PWM
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns u32: The PWM on duty duration, unit is ns
 */
SECTION_PWM_TEXT
u32 hal_rtl_pwm_read_duty_ns(hal_pwm_adapter_t *ppwm_adp)
{
	//pwm_comm_indread_idx_t pwm_indrd_idx;
	u32 duty_ticks;
	u32 duty_ns;
	u32 i = 0;

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	u32 PWM_INDRD_IDX;
	PWM_INDRD_IDX = 0;
	PWM_INDRD_IDX |= ppwm_adp->pwm_id;
	PWM_INDRD_IDX |= PWM_COMM_BIT_POOL;
	PWM_INDRD_IDX |= PWM_COMM_BIT_SYNC_MODE;

	// read the PWM duty tick count by in-direct reading
//    pwm_indrd_idx.w = 0;
//    pwm_indrd_idx.b.pwm_sel = ppwm_adp->pwm_id;
//    pwm_indrd_idx.b.pool = 1; // enable in-direct read
//    pwm_indrd_idx.b.sync_mode = 1; // in-direct read sync mode

	PWM_COMM_OBJ->PWM_COMM_INDREAD_IDX = PWM_INDRD_IDX;

	//ppwm_comm_adapter->base_addr->indread_idx = pwm_indrd_idx.w;
	//while (ppwm_comm_adapter->base_addr->indread_idx_b.pool == 1) {    // wait HW ready
	while (((PWM_COMM_OBJ->PWM_COMM_INDREAD_IDX & PWM_COMM_BIT_POOL) >> PWM_COMM_SHIFT_POOL) == 1) {
		hal_rtl_misc_delay_us(1);
		i++;
		if (i > 1000000) {
			DBG_PWM_ERR("hal_rtl_pwm_read_duty_ns: Wait indirect-read ready timeout\r\n");
			break;
		}
	}
	duty_ticks = PWM_COMM_OBJ->PWM_COMM_INDREAD_DUTY & PWM_COMM_MASK_PWM_DUTY;
	//duty_ticks = ppwm_comm_adapter->base_addr->indread_duty_b.pwm_duty;
	duty_ns = (duty_ticks * 50);
	return (duty_ns);


}

/** @} */ /* End of group hs_hal_pwm_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** @} */ /* End of group hs_hal_pwm */

SECTION_PWM_TEXT
void _pwm_dma_irq_handler(phal_pwm_adapter_t ppwm_adp)
{
#if 0
	UART0_Type *puart = puart_adapter->base_addr;

	puart->miscr_b.txdma_en = 0; // Disable UART TX DMA

	// update TX Buffer adddr
	puart_adapter->ptx_buf = (uint8_t *)((uint32_t)(puart_adapter->ptx_buf_sar) + puart_adapter->tx_count);

	// Wait all data in TX FIFO to be transfered
	// Enable TX FIFO empty interrupt (TX totally done)
	if (puart->tflvr_b.tx_fifo_lv == 0) {
		// Call user TX complete callback
		if (NULL != puart_adapter->tx_done_callback) {
			puart_adapter->tx_done_callback(puart_adapter->tx_done_cb_para);
		}
		uart_clear_state_rtl8710c(puart_adapter, HAL_UART_STATE_DMATX_BUSY);
	} else {
		puart->ier_b.etbei = 1;
	}
#endif
}

