swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_pwm.c
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_cache(IN phal_pwm_adapter_t ppwm_adp, IN void *dcache_clean_function, IN void *dcache_invalidate_function)
{
	if (dcache_clean_function == NULL) {
		ppwm_adp->dcache_clean_by_addr = (void (*)(uint32_t *, int32_t))rtl_dcache_clean_by_addr;
	} else {
		ppwm_adp->dcache_clean_by_addr = (void (*)(uint32_t *, int32_t))dcache_clean_function;
	}

	if (dcache_invalidate_function == NULL) {
		ppwm_adp->dcache_invalidate_by_addr = (void (*)(uint32_t *, int32_t))rtl_dcache_invalidate_by_addr;
	} else {
		ppwm_adp->dcache_invalidate_by_addr = (void (*)(uint32_t *, int32_t))dcache_invalidate_function;
	}
	return HAL_OK;
}




/**
 *  @brief To initial a GDMA channel for the PWM TX DMA mode transfer.
 *
 *  @param[in]  pwm_adapter  The PWM adapter.
 *  @param[in]  pgdma_chnl   The GDMA channel adapter. It is use to control the GDMA channel transfer.
 *  @param[in]  mode         Different dma mode, 5: only change duty, 6: only change period,
 *                           7: change duty and period simultaneously.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  GDMA channel initialization OK.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_dma_init(hal_pwm_adapter_t *ppwm_adp, phal_gdma_adaptor_t pgdma_chnl, int mode)
{
	uint32_t dst_per = 0;

	if ((NULL == ppwm_adp) || (NULL == pgdma_chnl)) {
		//dbg_printf("hal_pwm_tx_gdma_init: pwm_adapter=0x%x pgdma_chnl=0x%x\n", *ppwm_adp, pgdma_chnl);
		return HAL_ERR_PARA;
	}

	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

	switch (ppwm_adp->pwm_id) {
	case 0:
		dst_per = 20;
		HAL_WRITE32(0x40045020, 0x14, mode);
		break;
	case 1:
		dst_per = 21;
		HAL_WRITE32(0x40045040, 0x14, mode);
		break;
	case 2:
		dst_per = 22;
		HAL_WRITE32(0x40045060, 0x14, mode);
		break;
	case 3:
		dst_per = 23;
		HAL_WRITE32(0x40045080, 0x14, mode);
		break;
	}

	//dbg_printf("pwm_id %x dst_per %x\r\n", ppwm_adp->pwm_id, dst_per);

	pgdma_chnl->gdma_ctl.tt_fc      = TTFCMemToPeri;
	//pgdma_chnl->gdma_cfg.reload_dst = 1;
	pgdma_chnl->gdma_cfg.dest_per   = (u8)dst_per;                  //
	pgdma_chnl->ch_dar = (u32) & (PWM_OBJ->PWM_DMA_BUFF);
	//dbg_printf("pwm address %x\r\n", (u32)&(PWM_OBJ->PWM_DMA_BUFF) );
	pgdma_chnl->gdma_isr_type = (TransferType | ErrType);
	pgdma_chnl->gdma_ctl.int_en      = 1;
	pgdma_chnl->gdma_ctl.dinc = NoChange;
	pgdma_chnl->gdma_ctl.sinc = IncType;
	pgdma_chnl->have_chnl = 0;

	//hal_gdma_irq_reg(pgdma_chnl, (irq_handler_t)_pwm_dma_irq_handler, ppwm_adp);
	ppwm_adp->ptx_gdma = pgdma_chnl;
	return HAL_OK;



}

/**
 *  @brief To send a block of data by the DMA transmission mode.
 *
 *  @param[in]  pwm_adapter The PWM adapter.
 *  @param[in]  ptx_buf     The buffer of data to be transmitted.
 *  @param[in]  len         The length of data in bytes to be transmitted.
 *
 *  @return     HAL_OK: function execution OK.
 *  @return     HAL_BUSY: PWM TX is in busy state, previous transmission is not finished yet.
 *  @return     HAL_ERR_PARA: Input arguments are invalid.
 *  @return     HAL_NO_RESOURCE: Multiple-block DMA channel allocation failed.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_dma_send(hal_pwm_adapter_t *ppwm_adp, uint8_t *ptx_buf, uint32_t len)
{
	//uint32_t block_size;
	hal_gdma_adaptor_t *pgdma_chnl = ppwm_adp->ptx_gdma;

	if ((ptx_buf == NULL) || (len == 0) || (pgdma_chnl == NULL)) {
		//puart_adapter->tx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_PWM_ERR("hal_pwm_dma_send: Err: pTxData=0x%x,  Length=%d GDMA_Chnl=0x%x\n", ptx_buf, len, pgdma_chnl);
		return HAL_ERR_PARA;
	}

	pgdma_chnl->ch_sar = (uint32_t) ptx_buf;
	if (((len & 0x03) == 0) && (((uint32_t)(ptx_buf) & 0x03) == 0)) {
		// 4-bytes aligned, move 4 bytes each transfer
		pgdma_chnl->gdma_ctl.src_msize   = MsizeOne; // MsizeOne
		pgdma_chnl->gdma_ctl.src_tr_width = TrWidthFourBytes;
		pgdma_chnl->gdma_ctl.block_size = len >> 2;      // move 1 byte each transfer

	} else {
		pgdma_chnl->gdma_ctl.src_msize   = MsizeFour;
		pgdma_chnl->gdma_ctl.src_tr_width = TrWidthOneByte;
		pgdma_chnl->gdma_ctl.block_size = len;

	}


#if 0
	pgdma_chnl->gdma_ctl.dest_msize  = MsizeFour;
	pgdma_chnl->gdma_ctl.dst_tr_width = TrWidthOneByte;
#else
	pgdma_chnl->gdma_ctl.dest_msize  = MsizeOne; // MsizeOne
	pgdma_chnl->gdma_ctl.dst_tr_width = TrWidthFourBytes;
#endif

	if (ppwm_adp->dcache_clean_by_addr != NULL) {
		ppwm_adp->dcache_clean_by_addr((uint32_t *)ptx_buf, (int32_t)len);
	}
	if (pgdma_chnl->gdma_ctl.block_size <= MAX_DMA_BLOCK_SIZE) {
		//puart_adapter->base_addr->miscr_b.txdma_en = 1; // Enable UART TX DMA
		hal_rtl_gdma_transfer_start(pgdma_chnl, 0);
	}

	return HAL_OK;
}

/**
 *  @brief To initial a GDMA channel for the PWM TX DMA mode transfer.
 *
 *  @param[in]  pwm_adapter The PWM adapter.
 *  @param[in]  group       The PWM complementary pair, set this value to 0 for PWM0&1, 1 for PWM2&3...5 for PWMA&B.
 *  @param[in]  DB_value    The DandBand value for chosen PWM complementary pair.
 *  @param[in]  en          Enable or Disable PWM complementary mode.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  GDMA channel initialization OK.
 */
SECTION_PWM_TEXT
hal_status_t hal_rtl_pwm_complementary(hal_pwm_adapter_t *ppwm_adp, uint8_t group, uint8_t DB_value, bool en)
{
	if ((NULL == ppwm_adp) || (group > 5)) {
		return HAL_ERR_PARA;
	}

	PWM_COMM_TypeDef *PWM_COMM_OBJ =
		(PWM_COMM_TypeDef *)(ppwm_comm_adapter->base_addr);

	if (en == _TRUE) {
		// Enable corresponding pwm pair complementary mode
		PWM_COMM_OBJ->PWM_COMM_COMPLEMENTARY |= ((1 << group) & PWM_COMM_MASK_PWM_COMP_EN);
		// Clear DandBand value in corresponding pwm pair
		PWM_COMM_OBJ->PWM_COMM_COMPLEMENTARY &= ~(0xF << (PWM_COMM_SHIFT_PWM_DB + group * 4));
		// Set DandBand value in corresponding pwm pair
		PWM_COMM_OBJ->PWM_COMM_COMPLEMENTARY |= (DB_value << (PWM_COMM_SHIFT_PWM_DB + group * 4));
	} else if (en == _FALSE) {
		// Disable corresponding pwm pair complementary mode
		PWM_COMM_OBJ->PWM_COMM_COMPLEMENTARY &= ~((1 << group) & PWM_COMM_MASK_PWM_COMP_EN);
		// Clear DandBand value in corresponding pwm pair
		PWM_COMM_OBJ->PWM_COMM_COMPLEMENTARY &= ~(0xF << (PWM_COMM_SHIFT_PWM_DB + group * 4));
	}


	return HAL_OK;
}





#endif  // end of "#if CONFIG_PWM_EN && CONFIG_GTIMER_EN"




